artilleryTest.yml
config:
  target: http://54.193.183.224:4001
  phases:
    - duration: 60
      arrivalRate: 10
      name: "10 arrivals a sec for 1 min"
    - duration: 60
      arrivalRate: 100
      name: "100 arrivals a sec for 1 min"
    - duration: 60
      arrivalRate: 1000
      name: "1000 arrivals a sec for 1 min"
    - duration: 60
      arrivalRate: 100
      name: "100 arrivals a sec for 1 min"
scenarios:
  - flow:
    - loop:
        - get:
            url: "/"
        - get:
            url: "/{{ $loopElement }}"
      over:
        - hotel9900
        - hotel99000
        - hotel9900000